%% map the TT-100K id to changshu competition sign 

function typeStr=mapId2TypeString3(classId)
classTable={'其他','示31-非机动车行驶','示29-机动车行驶','示7-靠右侧道路行驶' ...,
    'il100','il60','il80','io','示19-人行横道','禁6-禁止机动车驶入'...,
    '禁33-禁止鸣笛','禁14-禁止摩托车驶入','禁23-禁止向右转弯','禁22-禁止向左转弯'...,
    '禁7-禁止载货汽车驶入','p27','禁9-禁止大型客车驶入','禁28-禁止掉头'...,
    '禁16-禁止非机动车进入','禁2-减速让行','禁35-限制高度','禁35-限制高度'...,
    '禁35-限制高度','禁38-限制速度','禁38-限制速度','禁38-限制速度','禁38-限制速度'...,
    '禁38-限制速度','禁38-限制速度','禁38-限制速度','禁38-限制速度','禁38-限制速度'...,
    '禁38-限制速度','禁36-限制质量','禁36-限制质量','禁36-限制质量','禁31-禁止停车'...,
    '禁5-禁止驶入','po','禁39-解除限制速度','警1-十字交叉','警38-施工','警11‐注意儿童'...,
    '警10‐注意行人','w59','wo'
};
typeStr=classTable(classId);
end