%% map the TT-100K id to changshu competition sign 

function typeStr=mapId2TypeString3(classId)
classTable={'其他','示 31-非机动车行驶','示 29-机动车行驶','示 7-靠右侧道路行驶' ...,
    'il100','il60','il80','io','示 19-人行横道','禁 6-禁止机动车驶入'...,
    '禁 33-禁止鸣笛','禁 14-禁止摩托车驶入','禁 23-禁止向右转弯','禁 22-禁止向左转弯'...,
    '禁 7-禁止载货汽车驶入','p27','禁 9-禁止大型客车驶入','禁 28-禁止掉头'...,
    '禁 16-禁止非机动车进入','禁 2-减速让行','禁 35-限制高度','禁 35-限制高度'...,
    '禁 35-限制高度','禁 38-限制速度','禁 38-限制速度','禁 38-限制速度','禁 38-限制速度'...,
    '禁 38-限制速度','禁 38-限制速度','禁 38-限制速度','禁 38-限制速度','禁 38-限制速度'...,
    '禁 38-限制速度','禁 36-限制质量','禁 36-限制质量','禁 36-限制质量','禁 31-禁止停车'...,
    '禁 5-禁止驶入','po','禁 39-解除限制速度','警 1-十字交叉','警 38-施工','警 11‐注意儿童'...,
    '警 10‐注意行人','w59','wo'
};
typeStr=classTable(classId);
end