function typeStr=mapId2TypeString(classId)
classTable={'警1-T型交叉下','警1-T型交叉右','警1-T型交叉左','警1-Y型交叉','警1-十字交叉' ...,
'警2(a)-向左急弯路','警2(b)-向右急弯路','警4-连续弯路','警5-上陡坡','警7-两侧变窄' ...,
'警7-左侧变窄','警9-双向交通','警10-注意行人','警11-注意儿童','警17-易滑' ...,
'警20-村庄','警23-驼峰桥','警35-慢行','警38-施工','禁2-减速让行'...,
'禁4-禁止通行','禁5-禁止驶入','禁6-禁止机动车驶入','禁7-禁止载货汽车驶入','禁9-禁止大型客车驶入' ...,
'禁14-禁止摩托车驶入','禁15-禁止某两种车驶入','禁16-禁止非机动车进入','禁21-禁止行人驶入','禁22-禁止向左转弯' ...,
'禁23-禁止向右转弯','禁28-禁止掉头','禁29-禁止超车','禁31-禁止停车','禁32-禁止长时停车' ...,
'禁33-禁止鸣笛','禁34-限制宽度','禁35-限制高度','禁36-限制质量','禁37-限制轴重' ...,
'禁38-限制速度','禁39-解除限制速度','示1-直行','示7-靠右侧道路行驶','示9-立体交叉直行和左转弯行驶' ...,
'示11-环岛行驶','示19-人行横道','示27-分向行驶车道','示28-公交线路专用车道','示29-机动车行驶' ...,
'示30-机动车车道','示31-非机动车行驶','示32-非机动车车道','示35-停车位','示36-允许掉头'
};
typeStr=classTable(classId);
end